//百钱买百鸡问题。
//一百个铜钱买了一百只鸡，其中公鸡一只5钱、母鸡一只3钱，小鸡一钱3只。问：一百只鸡中母鸡、公鸡、小鸡各有多少只？
//#include<stdio.h>
//int main()
//{
//	float x;
//	float y;
//	float z;
//	for (x = 1; x < 20; x++)
//	{
//		for (y = 1; y <= 33; y++)
//		{
//			for (z = 1; z < 100; z++)
//				if (x + y + z == 100 && 5 * x + 3 * y + z / 3 == 100)
//					printf("公鸡 %.2f	母鸡 %.2f	小鸡 %.2f \n", x, y, z);
//		}
//	}
//	return 0;
//
//}
//公鸡 4.00       母鸡 18.00      小鸡 78.00
//公鸡 8.00       母鸡 11.00      小鸡 81.00
//公鸡 12.00      母鸡 4.00       小鸡 84.00


//plan 1


#include<stdio.h>

int main() {
	int x, y, z;              //分别代表公鸡，母鸡，小鸡的数量
	for (x = 0; x <= 20; x++) {
		for (y = 0; y <= 33; y++) {
			z = 100 - x - y;
			if (z % 3 == 0 && (5 * x + 3 * y + z / 3) == 100) {    //小鸡肯定是整数
				printf("公鸡，母鸡，小鸡数：%d %d %d\n", x, y, z);
			}
		}
	}
}



//plan 2